Repository: RWS/trados-studio-api-samples
Catalog: LanguagePlatform/Sdl.SDK.LanguagePlatform.Samples.TmAutomation/Sample.tmx
Source language: en_us
Languages: de_de

source: The Check Spelling Command
de_de: Der Befehl Rechtschreibung

source: To run the Spelling Checker:
de_de: So führen Sie die Rechtschreibprüfung durch:

source: Place your cursor at the point in your document where you would like the spelling checker to begin.
de_de: Positionieren Sie den Cursor an der Stelle im Dokument, an der die Rechtschreibprüfung beginnen soll.

source: From the Tools menu, choose Spelling Checker or just click the button Check Spelling.
de_de: Wählen Sie im Menü Extras den Befehl Rechtschreibprüfung, oder klicken Sie auf die Schaltfläche Rechtschreibprüfung.

source: The spelling checker begins checking at the cursor position.
de_de: Das Dokument wird ab der aktuellen Cursorposition automatisch auf Rechtschreibfehler überprüft.

source: Configuring the Spelling Checker
de_de: Die Rechtschreibprüfung konfigurieren

source: To configure the spelling checker:
de_de: So konfigurieren Sie die Rechtschreibprüfung:

source: Select Ignore words in UPPERCASE to skip words containing uppercase characters only, for example, acronyms.
de_de: Wählen Sie Wörter in GROSSBUCHSTABEN ignorieren um Wörter in Großbuchstaben, z. B. Akronyme, zu ignorieren.

source: Select Ignore Internet and file addresses if you do not want the application to check Internet addresses, file names or email addresses.
de_de: Wählen Sie Internet- und Dateiadressen ignorieren, wenn Sie nicht möchten, dass die Anwendung die Rechtschreibung für Internetadressen, Dateinamen oder E-Mailadressen durchführt.

source: Language Support
de_de: Unterstützte Sprachen

source: If spelling errors are found in your target text, they are highlighted and the Check Spelling dialog box is displayed.
de_de: Wenn Rechtschreibfehler im Zieltext gefunden wurden, werden diese markiert und das Fenster Rechtschreibprüfung wird aufgerufen.

source: Chapter:
de_de: Kapitel:

source: On the Tools menu, click Options to display the Options dialog box.
de_de: Wählen Sie im Menü Extras den Befehl Optionen aus, um das Dialogfenster Optionen aufzurufen.

source: In the Options dialog box, click the Spelling & Grammar tab.
de_de: Klicken Sie im Dialogfenster Optionen auf den Reiter Rechtschreibung und Grammatik.

source: In the Spelling group box, choose the options that you want for the spelling checker:
de_de: Wählen Sie im Gruppenfeld Rechtschreibung die gewünschten Optionen für die Rechtschreibprüfung:

source: Select the Check Spelling as you type check box for automatic correction of misspellings as you type.
de_de: Aktivieren Sie das Kontrollkästchen neben Rechtschreibung während der Eingabe überprüfen, um Rechtschreibfehler während der Eingabe automatisch zu korrigieren.

source: Select Always suggest corrections to have the application suggest corrections to misspellings.
de_de: Wählen Sie den Befehl Immer Korrekturvorschläge unterbreiten, damit die Anwendung Korrekturvorschläge für Rechtschreibfehler unterbreitet.

source: Select Suggest from main dictionary only if you do not want the application to suggest spellings from any open Custom dictionaries.
de_de: Wählen Sie den Befehl Vorschläge nur aus Hauptwörterbuch, wenn Sie verhindern wollen, dass die Anwendung Vorschläge aus den Benutzerwörterbüchern unterbreitet.

source: Select Ignore words with numbers to skip words with one or several numbers.
de_de: Wählen Sie Wörter mit Zahlen ignorieren um Wörter, die Ziffern enthalten zu ignorieren.
